---
kind: property
id: P:Autodesk.Revit.DB.WorksharingSaveAsOptions.OpenWorksetsDefault
source: html/a22a67ee-b8ad-68d4-e055-6dcf69443c0a.htm
---
# Autodesk.Revit.DB.WorksharingSaveAsOptions.OpenWorksetsDefault Property

The default set of user-worksets to open when opening the model in the UI.
 Default is AskUserToSpecify.

## Syntax (C#)
```csharp
public SimpleWorksetConfiguration OpenWorksetsDefault { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration